
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # netbox_vpn_tunnel_group.tenants will be created
  + resource "netbox_vpn_tunnel_group" "tenants" {
      + description = "Tunnels to external tenants with devices not managed by us"
      + id          = (known after apply)
      + name        = "External Tenants"
      + slug        = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.site_v4 will be created
  + resource "netbox_available_prefix" "site_v4" {
      + description      = "Site prefix for R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + site_id          = 114
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.site_v6 will be created
  + resource "netbox_available_prefix" "site_v6" {
      + description      = "Site prefix for R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 97
      + prefix           = (known after apply)
      + prefix_length    = 56
      + site_id          = 114
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v4["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR3 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
      + vrf_id           = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v4["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR4 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
      + vrf_id           = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v4["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR5 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
      + vrf_id           = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
      + vrf_id           = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v6["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR3 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v6["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR4 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v6["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR5 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R70 (FranzFreunde)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.core["CR3"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to R70 (FranzFreunde)"
      + device_id     = 21
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel R70"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.core["CR4"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to R70 (FranzFreunde)"
      + device_id     = 22
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel R70"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to R70 (FranzFreunde)"
      + device_id     = 607
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel R70"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.tunnels["CR3"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR3"
      + device_id     = 677
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR3"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun0"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.tunnels["CR4"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR4"
      + device_id     = 677
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR4"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun1"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.tunnels["CR5"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR5"
      + device_id     = 677
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR5"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun2"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR6"
      + device_id     = 677
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR6"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun3"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_primary_ip.v4 will be created
  + resource "netbox_device_primary_ip" "v4" {
      + device_id          = 677
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 4
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_primary_ip.v6 will be created
  + resource "netbox_device_primary_ip" "v6" {
      + device_id          = 677
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_interface.core["CR5"] will be created
  + resource "netbox_interface" "core" {
      + description        = "Tunnel to R70 (FranzFreunde)"
      + enabled            = true
      + id                 = (known after apply)
      + mtu                = 1476
      + name               = (known after apply)
      + tags_all           = (known after apply)
      + virtual_machine_id = 48
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R70 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R70 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R70 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R70 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R70 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R70 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R70 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R70 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v4 will be created
  + resource "netbox_ip_address" "loopback_v4" {
      + description           = "Loopback address for R70 (FranzFreunde)"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v6 will be created
  + resource "netbox_ip_address" "loopback_v6" {
      + description           = "Loopback address for R70 (FranzFreunde)"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR3 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR4 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR5 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "virtualization.vminterface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
      + vrf_id                = 1
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR3 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR4 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR5 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "virtualization.vminterface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R70"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.tunnel_endpoint[0] will be created
  + resource "netbox_ip_address" "tunnel_endpoint" {
      + description           = "Tunnel endpoint for R70 (FranzFreunde)"
      + id                    = (known after apply)
      + ip_address            = "92.50.122.234/29"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_prefix.loopback_v6 will be created
  + resource "netbox_prefix" "loopback_v6" {
      + description = "Loopback prefix for R70 (FranzFreunde)"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + site_id     = 114
      + status      = "active"
      + tags_all    = (known after apply)
      + tenant_id   = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R70 (FranzFreunde)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R70"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R70 (FranzFreunde)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R70"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R70 (FranzFreunde)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R70"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R70 (FranzFreunde)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R70"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 175
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 176
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.core_vm["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_vm" {
      + id                           = (known after apply)
      + outside_ip_address_id        = 532
      + role                         = "peer"
      + tags_all                     = (known after apply)
      + tunnel_id                    = (known after apply)
      + virtual_machine_interface_id = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "677"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "677"
    }

Plan: 54 to add, 0 to change, 0 to destroy.
```